<a href="https://colab.research.google.com/github/BountyHunter1999/Machine-Learning-Zoom-Camp/blob/main/Homeworks/Homework%20%233.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Importing Necessary Modules

In [2]:
import numpy as np
import pandas as pd

import matplotlib.pyplot as plt

from sklearn.model_selection import train_test_split

%matplotlib inline

# Getting The Data and First Glance at it

In [1]:
!wget https://raw.githubusercontent.com/alexeygrigorev/datasets/master/AB_NYC_2019.csv

--2021-09-22 08:58:49--  https://raw.githubusercontent.com/alexeygrigorev/datasets/master/AB_NYC_2019.csv
Resolving raw.githubusercontent.com (raw.githubusercontent.com)... 185.199.108.133, 185.199.109.133, 185.199.110.133, ...
Connecting to raw.githubusercontent.com (raw.githubusercontent.com)|185.199.108.133|:443... connected.
HTTP request sent, awaiting response... 200 OK
Length: 7077973 (6.8M) [text/plain]
Saving to: ‘AB_NYC_2019.csv’

AB_NYC_2019.csv     100%[===================>]   6.75M  --.-KB/s    in 0.08s

2021-09-22 08:58:49 (84.3 MB/s) - ‘AB_NYC_2019.csv’ saved [7077973/7077973]

In [3]:
cols = ['neighbourhood_group',
'room_type',
'latitude',
'longitude',
'price',
'minimum_nights',
'number_of_reviews',
'reviews_per_month',
'calculated_host_listings_count',
'availability_365']

In [8]:
pd.read_csv("AB_NYC_2019.csv").shape # we don't need all of these

(48895, 16)

In [6]:
df = pd.read_csv("AB_NYC_2019.csv", usecols=cols) # getting only what we need

In [7]:
df.shape

(48895, 10)

## Looking At The Data

In [9]:
df.head()

  neighbourhood_group  ...  availability_365
0            Brooklyn  ...               365
1           Manhattan  ...               355
2           Manhattan  ...               365
3            Brooklyn  ...               194
4           Manhattan  ...                 0

[5 rows x 10 columns]

In [10]:
df.head().T

                                           0  ...                4
neighbourhood_group                 Brooklyn  ...        Manhattan
latitude                             40.6475  ...          40.7985
longitude                           -73.9724  ...          -73.944
room_type                       Private room  ...  Entire home/apt
price                                    149  ...               80
minimum_nights                             1  ...               10
number_of_reviews                          9  ...                9
reviews_per_month                       0.21  ...              0.1
calculated_host_listings_count             6  ...                1
availability_365                         365  ...                0

[10 rows x 5 columns]

## Checking Null Values

In [12]:
df.isnull().sum()

neighbourhood_group                   0
latitude                              0
longitude                             0
room_type                             0
price                                 0
minimum_nights                        0
number_of_reviews                     0
reviews_per_month                 10052
calculated_host_listings_count        0
availability_365                      0
dtype: int64

# DATA PREPARATION

### knowing about the data

In [15]:
df.dtypes

neighbourhood_group                object
latitude                          float64
longitude                         float64
room_type                          object
price                               int64
minimum_nights                      int64
number_of_reviews                   int64
reviews_per_month                 float64
calculated_host_listings_count      int64
availability_365                    int64
dtype: object

In [18]:
df.dtypes == "object"

neighbourhood_group                True
latitude                          False
longitude                         False
room_type                          True
price                             False
minimum_nights                    False
number_of_reviews                 False
reviews_per_month                 False
calculated_host_listings_count    False
availability_365                  False
dtype: bool

In [36]:
df.dtypes[df.dtypes == "object"]

neighbourhood_group    object
room_type              object
dtype: object

In [37]:
 df.dtypes[df.dtypes == 'object'].index

Index(['neighbourhood_group', 'room_type'], dtype='object')

In [38]:
categorical_cols = list(df.dtypes[df.dtypes == 'object'].index)
categorical_cols

['neighbourhood_group', 'room_type']

In [25]:
df.columns = df.columns.str.lower()

In [45]:
df[categorical_cols[0]][:4]

0     brooklyn
1    manhattan
2    manhattan
3     brooklyn
Name: neighbourhood_group, dtype: object

In [49]:
df[categorical_cols[0]][:4].str.lower().str.replace(" ", "_")

0     brooklyn
1    manhattan
2    manhattan
3     brooklyn
Name: neighbourhood_group, dtype: object

In [50]:
for c in categorical_cols:
  df[c] = df[c].str.lower().str.replace(" ", "_")

In [51]:
df.head().T

                                           0  ...                4
neighbourhood_group                 brooklyn  ...        manhattan
latitude                             40.6475  ...          40.7985
longitude                           -73.9724  ...          -73.944
room_type                       private_room  ...  entire_home/apt
price                                    149  ...               80
minimum_nights                             1  ...               10
number_of_reviews                          9  ...                9
reviews_per_month                       0.21  ...              0.1
calculated_host_listings_count             6  ...                1
availability_365                         365  ...                0

[10 rows x 5 columns]

In [54]:
df[categorical_cols].nunique()

neighbourhood_group    5
room_type              3
dtype: int64

In [56]:
df["neighbourhood_group"].value_counts()

manhattan        21661
brooklyn         20104
queens            5666
bronx             1091
staten_island      373
Name: neighbourhood_group, dtype: int64